app/views/profiles/show.html.erb

	<% if current_user.friends.include?(@user) || current_user.pending_friends.include?(@user)%>
		<%= link_to "Edit Friendship", edit_user_friendship_path(UserFriendship.where(friend_id: @user).first), class: 'btn' %>
---
SELECT "user_friendships".* FROM "user_friendships" WHERE "user_friendships"."friend_id" = 3 LIMIT 1