app/views/user_friendships/edit.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
---
		<%= image_tag @user_friendship.user.gravatar_url %><br />
		<%= @user_friendship.user.first_name %>