app/controllers/statuses_controller.rb

  def index
    @statuses = Status.all
---
SELECT "statuses".* FROM "statuses"

  def show
    @status = Status.find(params[:id])
---
SELECT "statuses".* FROM "statuses" WHERE "statuses"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @status = Status.find(params[:id])
---
SELECT "statuses".* FROM "statuses" WHERE "statuses"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @status = current_user.statuses.new(params[:status])

    respond_to do |format|
      if @status.save
---
INSERT INTO "statuses" ("content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["content", "rrrrr"], ["created_at", Sun, 04 Aug 2013 18:41:09 UTC +00:00], ["updated_at", Sun, 04 Aug 2013 18:41:09 UTC +00:00], ["user_id", nil]]

  def update
    @status = Status.find(params[:id])
    if params[:status] && params[:status].has_key?(:user_id)
      params[:status].delete(:user_id)
    end
    respond_to do |format|
      if @status.update_attributes(params[:status])
---
SELECT "statuses".* FROM "statuses" WHERE "statuses"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "statuses" SET "content" = 'YAY! I''m on treebook', "updated_at" = '2013-08-04 12:10:29.789291' WHERE "statuses"."id" = 1

  def destroy
    @status = Status.find(params[:id])
    @status.destroy
---
SELECT "statuses".* FROM "statuses" WHERE "statuses"."id" = ? LIMIT 1  [["id", "6"]]
DELETE FROM "statuses" WHERE "statuses"."id" = ?  [["id", 6]]