app/controllers/user_friendships_controller.rb

  def index
    @user_friendships = current_user.user_friendships.all
---
SELECT "user_friendships".* FROM "user_friendships" WHERE "user_friendships"."user_id" = 1

  def accept
    @user_friendship = current_user.user_friendships.find(params[:id])
---
SELECT "user_friendships".* FROM "user_friendships" WHERE "user_friendships"."user_id" = 3 AND "user_friendships"."id" = ? LIMIT 1  [["id", "44"]]
SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1

  def new
    if params[:friend_id]
      @friend = User.where(profile_name: params[:friend_id]).first
---
SELECT "users".* FROM "users" WHERE "users"."profile_name" = 'jasonseifer' LIMIT 1

  def create
  	if params[:user_friendship] && params[:user_friendship].has_key?(:friend_id)
      @friend = User.where(profile_name: params[:user_friendship][:friend_id]).first
---
SELECT "users".* FROM "users" WHERE "users"."profile_name" = 'jasonseifer' LIMIT 1

  def edit
    @user_friendship = UserFriendship.where(id: params[:id]).first.decorate
---
SELECT "user_friendships".* FROM "user_friendships" WHERE "user_friendships"."user_id" = 1 AND "user_friendships"."id" = ? LIMIT 1  [["id", "jasonseifer"]]

  def destroy
    @user_friendship = current_user.user_friendships.find(params[:id])
    if @user_friendship.destroy
---
SELECT "user_friendships".* FROM "user_friendships" WHERE "user_friendships"."user_id" = 1 AND "user_friendships"."id" = ? LIMIT 1  [["id", "56"]]
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
DELETE FROM "user_friendships" WHERE "user_friendships"."id" = ?  [["id", 56]]