app/controllers/user_friendships_controller.rb

SELECT "users".* FROM "users" WHERE "users"."friend_id" = '88' LIMIT 1
---
  def edit
    @user_friendship = current_user.user_friendships.find(params[:id])